Revit 2017 API
StructuralSectionCSlopedFlange Class
 Defines parameters for C-channel Sloped Flange structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2015
Syntax
C#
public class StructuralSectionCSlopedFlange : StructuralSectionHotRolled
Visual Basic
Public Class StructuralSectionCSlopedFlange _
	Inherits StructuralSectionHotRolled
Visual C++
public ref class StructuralSectionCSlopedFlange : public StructuralSectionHotRolled
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCSlopedFlange
See Also
StructuralSectionCSlopedFlange Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace